FoxIoT-EU/linux-kernel-nuc980/include/dt-bindings/dma/nuc980-pdma.h
/* SPDX-License-Identifier: (GPL-2.0-only OR MIT) */
/*
 * NUC980 PDMA Request Source Select (REQSEL) IDs
 *
 * From NUC980 TRM Rev 1.01, pages 321-323
 * (PDMAx_REQSEL0_3 register, REQSRC0 field)
 *
 * Note: "SPI0" in PDMA REQSEL = QSPI0 on NUC980
 */

#ifndef __DT_BINDINGS_DMA_NUC980_PDMA_H
#define __DT_BINDINGS_DMA_NUC980_PDMA_H

#define NUC980_PDMA_UART0_TX	4
#define NUC980_PDMA_UART0_RX	5
#define NUC980_PDMA_UART1_TX	6
#define NUC980_PDMA_UART1_RX	7
#define NUC980_PDMA_UART2_TX	8
#define NUC980_PDMA_UART2_RX	9
#define NUC980_PDMA_UART3_TX	10
#define NUC980_PDMA_UART3_RX	11
#define NUC980_PDMA_UART4_TX	12
#define NUC980_PDMA_UART4_RX	13
#define NUC980_PDMA_UART5_TX	14
#define NUC980_PDMA_UART5_RX	15
#define NUC980_PDMA_UART6_TX	16
#define NUC980_PDMA_UART6_RX	17
#define NUC980_PDMA_UART7_TX	18
#define NUC980_PDMA_UART7_RX	19
#define NUC980_PDMA_SPI0_TX	20	/* QSPI0 TX */
#define NUC980_PDMA_SPI0_RX	21	/* QSPI0 RX */
#define NUC980_PDMA_SPI1_TX	22
#define NUC980_PDMA_SPI1_RX	23
#define NUC980_PDMA_SPI2_TX	24
#define NUC980_PDMA_SPI2_RX	25
#define NUC980_PDMA_UART8_TX	26
#define NUC980_PDMA_UART8_RX	27
#define NUC980_PDMA_UART9_TX	28
#define NUC980_PDMA_UART9_RX	29
#define NUC980_PDMA_TIMER0	46
#define NUC980_PDMA_TIMER1	47
#define NUC980_PDMA_TIMER2	48
#define NUC980_PDMA_TIMER3	49
#define NUC980_PDMA_TIMER4	50
#define NUC980_PDMA_TIMER5	51

#endif /* __DT_BINDINGS_DMA_NUC980_PDMA_H */
